// Задача №1
// Створити три змінні
// apples = 30;
// plums = 70;
// Сума у змінній sum
// і вивести результат в консоль
const apples = 30;
const plums = 70;
const result = apples + plums;

console.log( result );

// Задача №1.1
// Створити три змінні
// bananas = 100;
// oranges = 30;
// Сума у змінній sum
// і вивести результат в консоль

// Задача №1.2
// Створити три змінні
// strawberry = 20;
// cherries = 15;
// Різниця у змінній difference
// і вивести результат в консоль

// ..............

// Задача №2
// Обєкт Math
// Визнгачити площу круга
// з радіусом 10см(ПR(2)).Math.pow(a, b) - піднести до степені
//  const rad = 10;
//  const PI = Math.PI;
//  const powRad = Math.pow( rad, 2);
//  const result = PI * powRad;

//  console.log(result);



// Задача №2.1
// Обєкт Math
// Визнгачити площу круга
// з радіусом 20см(ПR(3)).Math.pow(a, b) - піднести до степені

// Задача №2.2
// Обєкт Math
// Визнгачити площу круга
// з радіусом 100см(ПR(2)).Math.pow(a, b) - піднести до степені

// .................
// Задача №3
// Напиши скрипт який просить у користувача ввести число яке потрібно піднести до степеня,
//і піднести це число до степерні
//  і вивести результат в консоль
// console.log(prompt("Дай число"));
// console.log(prompt("В яку степень "));
// ..................
// Задача №4
// Доповни код, присвоївши змінній totalPrice вираз для підрахунку загальної суми замовлення.
// Змінна pricePerItem зберігає ціну однієї одиниці товару,
// а orderedQuantity - кількість одиниць товару в замовленні.

const pricePerItem = 3500;
const orderedQuantity = 4;
const totalPrice =pricePerItem * orderedQuantity;
console.log(totalPrice)

// .................

// Задача №5
// Магазин з продажу ремонтних дроїдів готовий до відкриття,
// залишилося написати скрипт для їх замовлення.Оголоси змінні та присвой їм відповідні значення:

// pricePerDroid - ціна одного дроїда, значення 800
// orderedQuantity - кількість дроїдів у замовленні, значення 6
// deliveryFee - вартість доставки, значення 50
// totalPrice - загальна сума замовлення до сплати, не забудь про вартість доставки
// результат виведи у консоль


